ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/DataProcessors/УТЗ_ПЛ_РабочееМестоСписанияПополненияТоплива/УТЗ_ПЛ_РабочееМестоСписанияПополненияТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УТЗ_ПЛ_РабочееМестоСписанияПополненияТоплива</name>
</mdclass:DataProcessor>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ТопливоКСписанию/УТЗ_ПЛ_ТопливоКСписанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ТопливоКСписанию</name>
  <resources>
    <name>КоличествоКСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.УТЗ_ПЛ_ПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_СписаниеТоплива/УТЗ_ПЛ_СписаниеТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_СписаниеТоплива</name>
  <registerRecords>InformationRegister.УТЗ_ПЛ_ЗаблокированныеДокументы</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКСписанию</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяСписания</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛист</name>
      <type>
        <types>DocumentRef.УТЗ_ПЛ_ПутевойЛист</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/DataProcessors/УТЗ_ПЛ_РабочееМестоСписанияПополненияТоплива/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ВнутреннееПотребление" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументСписания(Команда)
	
	ТекДанн = Элементы.ТЗПодразделения.ТекущиеДанные;
	Если ТекДанн = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подразделение не выбрано, создание документа отменено");
		Возврат;
	КонецЕсли;
	
	СозданныеДокументы = Неопределено;
	СоздатьДокументСписанияНаСервере(ТекДанн.Подразделение, СозданныеДокументы);
	
	Если ТипЗнч(СозданныеДокументы) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(СозданныеДокументы);
		
		Для Каждого СозданныйДокумент Из СозданныеДокументы Цикл
			ПараметрыФормы = Новый Структура("Ключ", СозданныйДокумент);
			ОткрытьФорму("Документ.УТЗ_ПЛ_СписаниеТоплива.Форма.ФормаДокумента"
						, ПараметрыФормы
						, ЭтотОбъект);
		КонецЦикла;
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеТЗТопливоКСписанию(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ТопливоКСписаниюВыделитьВсе(Команда)
	ТекСтр = Элементы.ТЗПодразделения.ТекущиеДанные;
	Подразделение = ТекСтр.Подразделение;
	
	Для Каждого Строка Из ТЗТопливоКСписанию Цикл
		
		Если Строка.Подразделение = Подразделение Тогда
			Строка.Пометка = Истина;
		Иначе
			Строка.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоКСписаниюСнятьВсеОтметки(Команда)
	Для Каждого Строка Из ТЗТопливоКСписанию Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанные()
	
	ТЗПодразделения.Очистить();
	ТЗТопливоКСписанию.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_ТопливоКСписаниюОстатки.ДокументСписания КАК ДокументСписания,
	|	УТЗ_ПЛ_ТопливоКСписаниюОстатки.Номенклатура КАК Номенклатура,
	|	УТЗ_ПЛ_ТопливоКСписаниюОстатки.Подразделение КАК Подразделение,
	|	УТЗ_ПЛ_ТопливоКСписаниюОстатки.Склад КАК Склад,
	|	УТЗ_ПЛ_ТопливоКСписаниюОстатки.КоличествоКСписаниюОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.УТЗ_ПЛ_ТопливоКСписанию.Остатки(&ДатаАктуальности, ) КАК УТЗ_ПЛ_ТопливоКСписаниюОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение
	|ИТОГИ ПО
	|	Подразделение
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаАктуальности", КонецДня(ТекущаяДатаСеанса()));
	
	ВыборкаПодразделения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделения.Следующий() Цикл
		
		СтрокаПодразделение = ТЗПодразделения.Добавить();
		СтрокаПодразделение.Подразделение = ВыборкаПодразделения.Подразделение;
		
		ВыборкаДетальныеЗаписи = ВыборкаПодразделения.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = ТЗТопливоКСписанию.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗПодразделенияПриАктивизацииСтроки(Элемент)
	
	ТекДанн = Элементы.ТЗПодразделения.ТекущиеДанные;
	
	Если ТекДанн = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = ТекДанн.Подразделение;
	
	Элементы.ТЗТопливоКСписанию.ОтборСтрок = Новый ФиксированнаяСтруктура("Подразделение", Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
		
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументСписанияНаСервере(Подразделение, СозданныеДокументы = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеТЗ.ДокументСписания КАК ДокументСписания,
	|	ДанныеТЗ.Номенклатура КАК Номенклатура,
	|	ДанныеТЗ.Склад КАК Склад,
	|	ДанныеТЗ.Количество КАК Количество,
	|	ДанныеТЗ.Подразделение КАК Подразделение,
	|	ДанныеТЗ.Пометка КАК Пометка
	|ПОМЕСТИТЬ ВТДанныеТЗТопливоКСписанию
	|ИЗ
	|	&ДанныеТЗ КАК ДанныеТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеТЗТопливоКСписанию.ДокументСписания КАК ДокументСписания,
	|	ВТДанныеТЗТопливоКСписанию.Номенклатура КАК Номенклатура,
	|	ВТДанныеТЗТопливоКСписанию.Склад КАК Склад,
	|	ВТДанныеТЗТопливоКСписанию.Количество КАК Количество,
	|	ВТДанныеТЗТопливоКСписанию.Подразделение КАК Подразделение,
	|	ВТДанныеТЗТопливоКСписанию.Пометка КАК Пометка
	|ИЗ
	|	ВТДанныеТЗТопливоКСписанию КАК ВТДанныеТЗТопливоКСписанию
	|ГДЕ
	|	ВТДанныеТЗТопливоКСписанию.Подразделение = &Подразделение
	|	И ВТДанныеТЗТопливоКСписанию.Пометка
	|ИТОГИ ПО
	|	Склад";
	Запрос.УстановитьПараметр("ДанныеТЗ", РеквизитФормыВЗначение("ТЗТопливоКСписанию"));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбраны строки расхода топлива. Создание документа отменено");
		Возврат;
	КонецЕсли;
	
	ВыборкаСклады = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СозданныеДокументы = Новый Массив;
	
	Пока ВыборкаСклады.Следующий() Цикл
			
		НовыйДокумент = Документы.УТЗ_ПЛ_СписаниеТоплива.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Организация = УТЗ_ПЛ_Организации.СсылкаОрганизацииУТЗ();
		НовыйДокумент.Подразделение = Подразделение;
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.Склад = ВыборкаСклады.Склад;
		НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		
		ВыборкаДетальныеЗаписи = ВыборкаСклады.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.ПутевойЛист = ВыборкаДетальныеЗаписи.ДокументСписания;
			
		КонецЦикла;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		СозданныеДокументы.Добавить(НовыйДокумент.Ссылка);
		
		ТекстСообщения = СтрШаблон("Документ ""%1"" создан. Необходимо его проверить, исправить и, при необходимости, перепровести", НовыйДокумент.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, НовыйДокумент.Ссылка);
		
	КонецЦикла;

	ОбновитьДанные();
	
	
КонецПроцедуры






#КонецОбласти
